//Написати гру "Камінь, ножниці, папір"  дані користувач отримує через prompt а результат гри виводити використовуючи alert (тут треба Math.random та if) 

 //Визначення переможця залежить від того, який жест показали гравці: Камінь б'є ножиці: камінь ламає ножиці. Ножиці б'ють папір: ножиці ріжуть папір. Папір б'є камінь: папір загортає камінь. Якщо обидва гравці показали однаковий жест, це нічия, і раунд повторюється.
 let startGame = prompt('Давайте зіграємо в гру:"Камінь, ножиці, папір". Введіть один з варіантів:');


 let gameValue = ['камінь', 'ножиці', 'папір'];
let randomIndex = gameValue[Math.floor(Math.random)*3] ;



    if (startGame.toLowerCase === randomIndex) {
   alert('нічия');
    }else if(
       (startGame.toLowerCase === 'камінь' && randomIndex=== 'ножиці')||
       (startGame.toLowerCase === 'ножиці' &&  randomIndex ==='папір') ||
       (startGame.toLowerCase ==='папір' && randomIndex=='камінь')
    ){
      alert('Ви перемогли!');
     
    }else{
        alert('Ви програли!');
    }
      
   


